#Реализовать структуру «Рейтинг», представляющую собой не возрастающий набор натуральных чисел.
# У пользователя необходимо запрашивать новый элемент рейтинга. Если в рейтинге существуют элементы с одинаковыми значениями,
# то новый элемент с тем же значением должен разместиться после них.
#Подсказка. Например, набор натуральных чисел: 7, 5, 3, 3, 2.
# Пользователь ввел число 3. Результат: 7, 5, 3, 3, 3, 2.
# Пользователь ввел число 8. Результат: 8, 7, 5, 3, 3, 2.
# Пользователь ввел число 1. Результат: 7, 5, 3, 3, 2, 1.
# Набор натуральных чисел можно задать непосредственно в коде, например, my_list = [7, 5, 3, 3, 2].

mlist = [15, 11, 11, 8, 4, 4, 4, 3, 1]
us_num = int(input('введите натуральное число: '))
if us_num in mlist:
    n = mlist.index(us_num) + mlist.count(us_num)
    mlist.insert(n, us_num)
else:
    mlist.append(us_num)
    mlist.sort(reverse = True)
print(mlist)