a_lst = []
i = 1
while True:
    d = {'название': '', 'цена': '', 'количество': '', 'ед_изм': ''}
    prod = input('Введите название товара, чтобы закончить, введите q: ')
    if prod =='q':
        break
    d['название'] = prod
    d['цена'] = (input('Введите цену товара: '))
    d['количество'] = (input('Введите количество товара: '))
    d['ед_изм'] = (input('Введите единицу измерения товара: '))

    goods = (i, d)
    a_lst.append(goods)
    i += 1
print(a_lst)
print('-----------------------------------------------------------------')
analitics = {'название':[], 'цена':[], 'количество':[], 'ед_изм':[]}
for j in range(0, len(a_lst) ):
    analitics['название'].append(a_lst[j][1].get('название'))
    analitics['цена'].append(a_lst[j][1].get('цена'))
    analitics['количество'].append(a_lst[j][1].get('количество'))
    analitics['ед_изм'].append(a_lst[j][1].get('ед_изм'))
print(f"название: {analitics['название']}")
print(f"цена: {analitics['цена']}")
print(f"количество: {analitics['количество']}")
print(f"единица измерения: {analitics['ед_изм']}")
print('-----------------------------------------------------------------')
print(analitics)
